Tekla Open API Reference for Tekla Structures 2025
Image Constructor (ViewBase, Point, String, EmbeddedObjectAttributes)
 Initializes a new instance of the Image class using the specified attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Image(
	ViewBase view,
	Point insertionPoint,
	string fileName,
	EmbeddedObjectAttributes attributes
)
Public Sub New (
	view As ViewBase,
	insertionPoint As Point,
	fileName As String,
	attributes As EmbeddedObjectAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
insertionPoint
Type: Tekla.Structures.Geometry3d.Point
The insertion point to be used.
fileName
Type: System.String
The filename to be used.
attributes
Type: Tekla.Structures.Drawing.EmbeddedObjectAttributes
The attributes to be used.
Exceptions
Exception | Condition
FileNotFoundException | Thrown if the specified file does not exist.
See Also
Reference
Image Class
Image Overload
Tekla.Structures.Drawing Namespace